'''
Задача-1: Написать класс Command. В конструктор класса передать переменную
positions. Она будет содержать список с должностями. В конструкторе класса
определить эту переменную как атрибут класса и АБСОЛЮТНО инкапсулировать.
Переопределить методы __len__ и __contains__ класса. Метод __len__ должен
выводит сообщение о переопределении метода и размер списка. Метод __contains__
должен выводить очередной элемент из списка. (не забудьте этот элемент
передать в сам метод). Создать экземпляр класса с данными. В экземпляр передать
список. Проверить работу методов. Второй метод будет проверять, входит ли
элемент в список
'''




